/*
 * main.c
 *
 *  Created on: Jul 2, 2014
 *      Author: vuclip123
 */

//p211-290
//7.2 图的定义
	// 7.2.1 各种图的定义
		// 无向图
		// 有向图
		// 简单图 ： 在图中，不存在顶点到其自身的边，而且同一条边不重复，称简单图
		// 完全无向图 任意两个点直接都存在边的图。包含n个顶点的边n*(n-1)/2.
		// 完全有向图 包含n个顶点的边n*(n-1).
		// 权 与图的边或弧相关的数
		// 网 带权的图叫网
		// 子图

	// 7.2.2 图的顶点和边的关系

	// 7.2.3 连同图相关术语
		// 无向图中G中，如果从顶点v到v‘有路径，则陈G是连同的，如果对于图中任意两点，都是连同的，称连同图//===

	// 7.2.4 图的定义

//7.3 图的抽象数据类型

//7.4 图的存储结构
	// 7.4.1 邻接矩阵
	// 7.4.2 邻接表
	// 7.4.3 十字链表
	// 7.4.4 邻接多重表
	// 7.4.5 边集数组

//7.5 图的遍历

//7.6 最小生成树

//7.7 最短路径

//7.8 拓扑排序

//7.9 关键路径

//7.10 总结回顾
