/*
 * main.c
 *
 *  Created on: Jun 26, 2014
 *      Author: vuclip123
 */


//6.2 树的定义
	//树是n (n>=0)个结点的有限集，n=0时称为空树。在任意一颗非空树中：
	//1 有且仅有一个特定的称为根的结点
	//2 当n>1时，其余结点可分为m（m>0）个互不相交的有限集T1 T2 ... Tm ，其中每一个集合本身又是一颗树,
	//	并且称为根的子树
	// 6.2.1 结点分类
		// 结点拥有的子树称为结点的度，度为0的结点称为叶结点或终端结点
		// 度不为0的结点称为分支点或非终端结点，树的度是树内各结点的度的最大值
	// 6.2.2 结点间关系
	// 6.2.3 树的其他关系
		// 结点的层次，从根开始定义起，根为第一层，根的孩子为第二层，树中结点的最大层次称为树的深度

//6.3 树的抽象数据类型

//6.4 树的存储结构 双亲表示法 孩子表示法 孩子兄弟表示法

	// 6.4.1 双亲表示法

	// 6.4.2 孩子表示法

	// 6.4.3 孩子兄弟表示法
	//????


//6.5 二叉树

	// 6.4.1 双亲表示法

	// 6.4.1 双亲表示法

//6.6 二叉树的性质

//6.7 二叉树的存储结构

//6.8 遍历二叉树







